<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"6dca23bcaed5240f40aca43fc04011522eae10f19b35bfe4f4b8541ff1021e5e","plan_job_ref":"Job .github/workflows/_test-tf.yaml #220 at https://github.com/tx-pts-dai/github-workflows/actions/runs/11592970283","plan_out_hash":"85e0421fa01ce2798f5265a55f64c2cde3670056eef331a44a0537626044f236","plan_hash":"c360a0af04862d77056906a7fd8dbe1dc0fbb6468dd6c9112256564b108bf54f","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #220](https://github.com/tx-pts-dai/github-workflows/actions/runs/11592970283)